const {getArticlesDataByIds} = require('../../utils');

class Article {
  data() {
    return {
      number: 85,
      permalink: 'articles/85/index.html',
      description:
        'До повноважень Верховної Ради України належить: внесення змін до Конституції України в межах і порядку, передбачених розділом XIII цієї Конституції...',
    };
  }

  render(data) {
    const articles = data.collections.article;
    const articlesNumbers = [73, 111];
    const articlesData = getArticlesDataByIds(articlesNumbers, articles);

    return `
<p>До повноважень Верховної Ради України належить:</p>
<ol>
    <li>
        <p>внесення змін до Конституції України в межах і порядку, передбачених розділом XIII цієї Конституції;</p>
    </li>
    <li>
        <p>призначення всеукраїнського референдуму з питань, визначених <a href="${articlesData[73].url}"  title="${articlesData[73].content}">статтею 73</a> цієї Конституції;</p>
    </li>
    <li>
        <p>прийняття законів;</p>
    </li>
    <li>
        <p>затвердження Державного бюджету України та внесення змін до нього, контроль за виконанням Державного бюджету України, прийняття рішення щодо звіту про його виконання;</p>
    </li>
    <li>
        <p>визначення засад внутрішньої і зовнішньої політики, реалізації стратегічного курсу держави на набуття повноправного членства України в Європейському Союзі та в Організації Північноатлантичного договору;</p>
    </li>
    <li>
        <p>затвердження загальнодержавних програм економічного, науково-технічного, соціального, національно-культурного розвитку, охорони довкілля;</p>
    </li>
    <li>
        <p>призначення виборів Президента України у строки, передбачені цією Конституцією;</p>
    </li>
    <li>
        <p>заслуховування щорічних та позачергових послань Президента України про внутрішнє і зовнішнє становище України;</p>
    </li>
    <li>
        <p>оголошення за поданням Президента України стану війни і укладення миру, схвалення рішення Президента України про використання Збройних Сил України та інших військових формувань у разі збройної агресії проти України;</p>
    </li>
    <li>
        <p>усунення Президента України з поста в порядку особливої процедури (імпічменту), встановленому <a href="${articlesData[111].url}"  title="${articlesData[111].content}">статтею 111</a> цієї Конституції;</p>
    </li>
    <li>
        <p>розгляд і прийняття рішення щодо схвалення Програми діяльності Кабінету Міністрів України;</p>
    </li>
    <li>
        <p>призначення за поданням Президента України Прем'єр-міністра України, Міністра оборони України, Міністра закордонних справ України, призначення за поданням Прем'єр-міністра України інших членів Кабінету Міністрів України, Голови Антимонопольного комітету України, Голови Державного комітету телебачення і радіомовлення України, Голови Фонду державного майна України, звільнення зазначених осіб з посад, вирішення питання про відставку Прем'єр-міністра України, членів Кабінету Міністрів України;</p>
        <ol>
            <li>призначення на посаду та звільнення з посади за поданням Президента України Голови Служби безпеки України;
            </li>
        </ol>
    </li>
    <li>
        <p>здійснення контролю за діяльністю Кабінету Міністрів України відповідно до цієї Конституції та закону;</p>
    </li>
    <li>
        <p>затвердження рішень про надання Україною позик і економічної допомоги іноземним державам та міжнародним організаціям, а також про одержання Україною від іноземних держав, банків і міжнародних фінансових організацій позик, не передбачених Державним бюджетом України, здійснення контролю за їх використанням;</p>
    </li>
    <li>
        <p>прийняття Регламенту Верховної Ради України;</p>
    </li>
    <li>
        <p>призначення на посади та звільнення з посад Голови та інших членів Рахункової палати;</p>
    </li>
    <li>
        <p>призначення на посаду та звільнення з посади Уповноваженого Верховної Ради України з прав людини; заслуховування його щорічних доповідей про стан дотримання та захисту прав і свобод людини в Україні;</p>
    </li>
    <li>
        <p>призначення на посаду та звільнення з посади Голови Національного банку України за поданням Президента України;</p>
    </li>
    <li>
        <p>призначення на посади та звільнення з посад половини складу Ради Національного банку України;</p>
    </li>
    <li>
        <p>призначення на посади та звільнення з посад половини складу Національної ради України з питань телебачення і радіомовлення;</p>
    </li>
    <li>
        <p>призначення на посади та звільнення з посад членів Центральної виборчої комісії за поданням Президента України;</p>
    </li>
    <li>
        <p>затвердження загальної структури, чисельності, визначення функцій Служби безпеки України, Збройних Сил України, інших утворених відповідно до законів України військових формувань, а також Міністерства внутрішніх справ України;</p>
    </li>
    <li>
        <p>схвалення рішення про надання військової допомоги іншим державам, про направлення підрозділів Збройних Сил України до іншої держави чи про допуск підрозділів збройних сил інших держав на територію України;</p>
    </li>
    <li>
        <p>встановлення державних символів України;</p>
    </li>
    <li>
        <p>надання згоди на призначення на посаду та звільнення з посади Президентом України Генерального прокурора; висловлення недовіри Генеральному прокуророві, що має наслідком його відставку з посади;</p>
    </li>
    <li>
        <p>призначення на посади третини складу Конституційного Суду України;</p>
    </li>
</ol>
<p><em>{Пункт 27 частини першої статті 85 виключено на підставі
    Закону <a href="https://zakon.rada.gov.ua/laws/show/1401-19#n147">№ 1401-VIII від 02.06.2016</a>}</em></p>
<ol start="28">
    <li>
        <p>дострокове припинення повноважень Верховної Ради Автономної Республіки Крим за наявності висновку Конституційного Суду України про порушення нею Конституції України або законів України; призначення позачергових виборів до Верховної Ради Автономної Республіки Крим;</p>
    </li>
    <li>
        <p>утворення і ліквідація районів, встановлення і зміна меж районів і міст, віднесення населених пунктів до категорії міст, найменування і перейменування населених пунктів і районів;</p>
    </li>
    <li>
        <p>призначення чергових та позачергових виборів до органів місцевого самоврядування;</p>
    </li>
    <li>
        <p>затвердження протягом двох днів з моменту звернення Президента України указів про введення воєнного чи надзвичайного стану в Україні або в окремих її місцевостях, про загальну або часткову мобілізацію, про оголошення окремих місцевостей зонами надзвичайної екологічної ситуації;</p>
    </li>
    <li>
        <p>надання законом згоди на обов'язковість міжнародних договорів України та денонсація міжнародних договорів України;</p>
    </li>
    <li>
        <p>здійснення парламентського контролю у межах, визначених цією Конституцією та законом;</p>
    </li>
    <li>
        <p>прийняття рішення про направлення запиту до Президента України на вимогу народного депутата України, групи народних депутатів України чи комітету Верховної Ради України, попередньо підтриману не менш як однією третиною від конституційного складу Верховної Ради України;</p>
    </li>
    <li>
        <p>призначення на посаду та звільнення з посади керівника апарату Верховної Ради України; затвердження кошторису Верховної Ради України та структури її апарату;</p>
    </li>
    <li>
        <p>затвердження переліку об'єктів права державної власності, що не підлягають приватизації, визначення правових засад вилучення об'єктів права приватної власності;</p>
    </li>
    <li>
        <p>затвердження законом Конституції Автономної Республіки Крим, змін до неї.</p>
    </li>
</ol>
<p>Верховна Рада України здійснює також інші повноваження, які відповідно до Конституції України віднесені до її відання.</p>
    `;
  }
}

module.exports = Article;
