const {getArticlesDataByIds} = require('../../utils');

class Article {
  data() {
    return {
      number: 114,
      permalink: 'articles/114/index.html',
    };
  }

  render(data) {
    const articles = data.collections.article;
    const articlesNumbers = [83];
    const articlesData = getArticlesDataByIds(articlesNumbers, articles);

    function Article(number, children = number) {
      return `<a href="${articlesData[number].url}" title="${articlesData[number].content}">${children}</a>`;
    }

    return `
<p>До складу Кабінету Міністрів України входять Прем'єр-міністр України, Перший віце-прем'єр-міністр,
    віце-прем'єр-міністри, міністри.</p>
<p>Прем'єр-міністр України призначається Верховною Радою України за поданням Президента України.</p>
<p>Кандидатуру для призначення на посаду Прем'єр-міністра України вносить Президент України за пропозицією коаліції
    депутатських фракцій у Верховній Раді України, сформованої відповідно до ${Article(
      83,
      'статті 83',
    )} Конституції України, або
    депутатської
    фракції, до складу якої входить більшість народних депутатів України від конституційного складу Верховної Ради
    України.</p>
<p>Міністр оборони України, Міністр закордонних справ України призначаються Верховною Радою України за поданням
    Президента
    України, інші члени Кабінету Міністрів України призначаються Верховною Радою України за поданням Прем'єр-міністра
    України.</p>
<p>Прем'єр-міністр України керує роботою Кабінету Міністрів України, спрямовує її на виконання Програми діяльності
    Кабінету
    Міністрів України, схваленої Верховною Радою України.</p>
    `;
  }
}

module.exports = Article;
